Revit 2017 API
Application.NewPlane Method (XYZ, XYZ, XYZ)
Creates a new geometric plane object based on two coordinate vectors and an origin.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByOriginAndBasis() instead.")]
public Plane NewPlane(
	XYZ xVec,
	XYZ yVec,
	XYZ origin
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByOriginAndBasis() instead.")> _
Public Function NewPlane ( _
	xVec As XYZ, _
	yVec As XYZ, _
	origin As XYZ _
) As Plane
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Please use Plane.CreateByOriginAndBasis() instead.")]
public:
Plane^ NewPlane(
	XYZ^ xVec,
	XYZ^ yVec,
	XYZ^ origin
)
Parameters
xVec
Type: Autodesk.Revit.DB.XYZ
X vector of the plane coordinate system.
yVec
Type: Autodesk.Revit.DB.XYZ
Y vector of the plane coordinate system.
origin
Type: Autodesk.Revit.DB.XYZ
Origin of the plane coordinate system.
Return Value
A new plane object.
See Also
Application Class
NewPlane Overload
Autodesk.Revit.Creation Namespace